# DefaultRowHeightOnSheet Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CustomFieldData..::..DefaultRowHeightOnSheet Property
CustomFieldData Class See Also
---
Identifies the default row height for this field.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public double DefaultRowHeightOnSheet { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DefaultRowHeightOnSheet As Double
	Get
```

Visual C++
---
```text
public:
property double DefaultRowHeightOnSheet {
	double get ();
}
```

# See Also
CustomFieldData Class
Autodesk.Revit.DB Namespace